%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%   
%---------------------------最后修改的MFCC参数-----------------------------%
%
%对输入的语音序列x进行MFCC参数的提取，返回MFCC参数、一阶MFCC参数和二阶MFCC参数
%差分MFCC参数，Mel滤波器的个数为p，采样频率为sr
%对x每frameSize点分为一帧，相邻两帧之间的帧移为inc
%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function mfcc_12=mfcc(x,sr,frameSize,inc)
%--------------------------------------------------------------------------
% 系数设定
p=24;
%--------------------------------------------------------------------------
bank=melbankm(p,frameSize,sr,0,0.5,'m');
% 归一化mel滤波器组系数
bank=full(bank);
bank=bank/max(bank(:));
% DCT系数,12*24,12维
p2=p/2;
for k=1:p2
    n=0:23;
    dctcoef(k,:)=cos((2*n+1)*k*pi/(2*24));
end
% 归一化倒谱提升窗口
w = 1 + 6 * sin(pi * [1:p2] ./ p2);
w = w/max(w);
%--------------------------------------------------------------------------
% 预加重滤波器
xx=double(x);
xx=filter([1 -0.9375],1,xx);
% 语音信号分帧
xx=enframe(xx,frameSize,inc);
n2=fix(frameSize/2)+1;
%--------------------------------------------------------------------------
% 求每帧的短时能量
fn=size(xx,1);             % 求出帧数
for k=1 : fn
    u=xx(k,:);             % 取出一帧
    u2=u.*u;               % 求出能量
    En(k)=sum(u2);         % 将一帧的短时能量存储在En中
end
%--------------------------------------------------------------------------
% 计算每帧的MFCC参数
for i=1:size(xx,1)
  y = xx(i,:);
  s = y' .* hamming(frameSize);
  t = abs(fft(s));
  t = t.^2;
  c1=dctcoef * log(bank * t(1:n2));
  c2 = c1.*w';
  m(i,:)=c2';
end
m=[En' m];
%--------------------------------------------------------------------------
% 一阶差分系数
sum_c=(-2)^2+(-1)^2+1^2+2^2;
dtm_1 = zeros(size(m));
for i=3:size(m,1)-2
  dtm_1(i,:) = -2*m(i-2,:) - m(i-1,:) + m(i+1,:) + 2*m(i+2,:);
end
dtm_1=dtm_1/sum_c;
%--------------------------------------------------------------------------
% 二阶差分系数
dtm_2=zeros(size(dtm_1));
for j=3:size(dtm_1,1)-2
    dtm_2(j,:)=-2*dtm_1(j-2,:) - dtm_1(j-1,:) + dtm_1(j+1,:) + 2*dtm_1(j+2,:);
end
dtm_2=dtm_2/sum_c;
%--------------------------------------------------------------------------
% 输出参数 13维包括能量维 12维不包括能量维
m_1=[m dtm_1];
m_2=[m dtm_1 dtm_2];
% mfcc参数
mfcc_13=m;
mfcc_12=mfcc_13(:,2:13);
% 合并mfcc参数和一阶差分mfcc参数
mfcc_26=m_1(3:size(m_1,1)-2,:);
mfcc_24=mfcc_26(:,[2:13 15:26]);
% 合并mfcc参数、一阶差分mfcc参数和二阶差分mfcc参数
mfcc_39=m_2(5:size(m_2,1)-4,:);
mfcc_36=mfcc_39(:,[2:13 15:26 28:39]);
%--------------------------------------------------------------------------